# MEPConnectorInfo Class

---
MEP connector information.
SystemObject Autodesk.Revit.DBMEPConnectorInfo Autodesk.Revit.DBMEPFamilyConnectorInfo
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class MEPConnectorInfo : IDisposable

    Public Class MEPConnectorInfo
    	Implements IDisposable

    public ref class MEPConnectorInfo : IDisposable

    type MEPConnectorInfo =
        class
            interface IDisposable
        end
The MEPConnectorInfo type exposes the following members.
| Name| Description
---|---|---
| IsPrimary|  True if this is the primary connector.
| IsSecondary|  True if this is the secondary connector.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| LinkedConnector|  The linked connector or  if there is no linked connector
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the MEPConnectorInfo
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace